In [253]:
import pandas as pd
import numpy as np

In [254]:
score = pd.DataFrame({
    'username' : ['hayan2', 'cuteduhan', 'han5min5', 'ghwls1153', 'seunghyeon^^', 'kibeom', 'mukeun'],
    'wins' : [152, 0, 56, 85, 12, 33, 27],
    'defeats' : [0, 2005, 13, 52, 16, 81, 8],
    'draws' : [0, 6, 1, 5, 6, 7, 1]
})
score

       username  wins  defeats  draws
0        hayan2   152        0      0
1     cuteduhan     0     2005      6
2      han5min5    56       13      1
3     ghwls1153    85       52      5
4  seunghyeon^^    12       16      6
5        kibeom    33       81      7
6        mukeun    27        8      1

In [255]:
score['winsRate'] = (score['wins'] / (score['wins'] + score['defeats'] + score['draws']) * 100)
score

       username  wins  defeats  draws    winsRate
0        hayan2   152        0      0  100.000000
1     cuteduhan     0     2005      6    0.000000
2      han5min5    56       13      1   80.000000
3     ghwls1153    85       52      5   59.859155
4  seunghyeon^^    12       16      6   35.294118
5        kibeom    33       81      7   27.272727
6        mukeun    27        8      1   75.000000

In [256]:
# read csv file
score.to_csv('ranking-board.csv', encoding = 'utf-8-sig', index = False)

In [257]:
score = pd.read_csv('ranking-board.csv')
score

       username  wins  defeats  draws    winsRate
0        hayan2   152        0      0  100.000000
1     cuteduhan     0     2005      6    0.000000
2      han5min5    56       13      1   80.000000
3     ghwls1153    85       52      5   59.859155
4  seunghyeon^^    12       16      6   35.294118
5        kibeom    33       81      7   27.272727
6        mukeun    27        8      1   75.000000

In [238]:
# check attribute in column exists
# if it exists print True 
# if it isn't exists print False
username = '123'

if (getattr(score, 'username').isin([username]).any() == False):
    print("not exist")
    new_row = pd.Series([username, 0, 0, 0, 0.0], index = score.columns)
    score = score.append(new_row, ignore_index=True)

not exist

C:\Users\hayan2\AppData\Local\Temp\ipykernel_11280\11431551.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  score = score.append(new_row, ignore_index=True)

In [85]:
# wins or defeats increase after game
# winsRate => wins / (wins + defeats)

username = input("Username")
wins = score[score['username'] == username]['wins']
defeats = score[score['username'] == username]['defeats']
draws = score[score['username'] == username]['draws']

# winsRate
format(float(wins / (wins + defeats + draws) * 100), ".2f")

score[score['username'] == username]['winsRate']

Usernamehayan2

In [124]:
# draw barh graph order by wins but display with winsRate
username = input("name")
score = pd.read_csv('ranking-board.csv')
# print(score.loc[score['username'] == 'hayan2', 'defeats'])

score.to_csv('ranking-board.csv', encoding = 'utf-8-sig', index = False)
score

namehayan2

   winsRate
0         0

In [117]:
score = pd.read_csv('ranking-board.csv')
score

  username  wins  defeats  draws  winsRate
0   hayan2     2       37      0         0

In [127]:
score

  username  wins  defeats  draws  winsRate
0   hayan2     2        1      0         0